Tekla Open API Reference for Tekla Structures 2025
AnalysisModelHandler.AddPart Method
 Adds a part to the analysis model. The ConstructionMethod must be SELECTED_PARTS, SELECTED_PARTS_AND_LOADS or FLOOR_BY_SELECTED_PARTS_AND_LOADS.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void AddPart(
	AnalysisModel AnalysisModel,
	Part ModelPart
)
Public Sub AddPart (
	AnalysisModel As AnalysisModel,
	ModelPart As Part
)
Parameters
AnalysisModel
Type: Tekla.Structures.Analysis.AnalysisModel
The analysis model to be used.
ModelPart
Type: Tekla.Structures.Model.Part
The model part to be used.
See Also
Reference
AnalysisModelHandler Class
Tekla.Structures.Analysis Namespace